app/Controllers/Pages.php

SELECT *
FROM `teams`
---
    public function view($page = 'home')
    {
        if (!is_file(APPPATH . 'Views/pages/' . $page . '.php')) {
            throw PageNotFoundException::forPageNotFound();
        }

        $data = [];

        if ($page === 'teams') {
            $model = new Team_model();
            $data['teams'] = $model->findAll(); // fetch all from the DB